:PROPERTIES:
:ID:       133c1418-9705-4528-8856-ccaea4a3d0ff
:END:
#+TITLE: Security
#+DESCRIPTION: General Security
#+TAGS:

***** Automatic enumeration

Using this command prints the filetree that corresponds to a list of files

#+begin_src sh
find . -maxdepth 3 -type d -wholename "*terraform*" ! -name ".git" -print | tree --fromfile .
#+end_src

So all I need to do is get the categories to look like paths and =tree= will draw
it in CLI or in JSON/XML. The =pwsafe-cli= and =loxodo.py= scripts don't enumerate
groups without exporting or outputting passwords, so I just manually listed the
categories with some edits.

It's already fairly close to the apple categories, but needs a lot of edits.
Ultimately, I'll partition these passwords into two sets for the main identity
(with a few extra details) and then one for each additional identity. When
planning this, it really helps to just see the shapes of data in plain text.

#+begin_src sh :results output verbatim :var catfile=(read)
cat $catfile | tree --fromfile .
#+end_src

#+RESULTS:
#+begin_example
.
├── academic
├── art
├── btc
├── cmd
├── Comms
├── design
├── dev
│   ├── apache
│   ├── appistack
│   ├── guix
│   ├── keychains
│   ├── keys
│   ├── misc
│   ├── open-source
│   ├── ops
│   ├── star-tek
│   └── zig
├── DG
├── dj
├── edu
├── fin
├── forum
├── forums
├── games
├── govt
├── gpg
├── inet
├── irc
├── job
│   ├── facebook
│   └── walmart
├── med
├── misc
├── net
│   ├── keys
│   └── wifi
├── oscilio
├── proverse (aeronautical)
├── retail
├── ro
│   └── xel
│       └── io
├── skateplay
├── social
└── Support

6 directories, 41 files
#+end_example


